talpachen/vsf_2017/vsf/hal/cpu/gd32e10x/Include/gd32e10x_usb_regs.h
/* device OUT endpoint-x interrupt flag register bits definitions */
#define DOEPINTF_BTBSTP           BIT(6)              /*!< back-to-back SETUP packets */
#define DOEPINTF_EPRXFOVR         BIT(4)              /*!< endpoint Rx FIFO overrun */
#define DOEPINTF_STPF             BIT(3)              /*!< SETUP phase finished */
#define DOEPINTF_EPDIS            BIT(1)              /*!< endpoint disabled */
#define DOEPINTF_TF               BIT(0)              /*!< transfer finished */

/* device IN endpoint 0 transfer length register bits definitions */
#define DIEP0LEN_PCNT             BITS(19, 20)        /*!< packet count */
#define DIEP0LEN_TLEN             BITS(0, 6)          /*!< transfer length */

/* device OUT endpoint 0 transfer length register bits definitions */
#define DOEP0LEN_STPCNT           BITS(29, 30)        /*!< SETUP packet count */
#define DOEP0LEN_PCNT             BIT(19)             /*!< packet count */
#define DOEP0LEN_TLEN             BITS(0, 6)          /*!< transfer length */

/* device OUT endpoint-x transfer length register bits definitions */
#define DOEPLEN_RXDPID            BITS(29, 30)        /*!< received data PID */
#define DOEPLEN_STPCNT            BITS(29, 30)        /*!< SETUP packet count */
#define DEPLEN_PCNT               BITS(19, 28)        /*!< packet count */
#define DEPLEN_TLEN               BITS(0, 18)         /*!< transfer length */

/* device IN endpoint-x transmit FIFO status register bits definitions */
#define DIEPTFSTAT_IEPTFS         BITS(0, 15)         /*!< IN endpoint¡¯s Tx FIFO space remaining */

/* USB power and clock registers bits definition */
#define PWRCLKCTL_SHCLK           BIT(1)              /*!< stop HCLK */
#define PWRCLKCTL_SUCLK           BIT(0)              /*!< stop the USB clock */

/* register options defines */
#define USB_UTT(x)                (((x) << 10) & GUSBCS_UTT)               /*!< USB turn around time */

#define RSTAT_EPNUM(x)            ((uint8_t)((x) & GRSTATRP_EPNUM))        /*!< Rx FIFO endpoint number   */
#define RSTAT_BLEN(x)             (((x) & GRSTATRP_BCOUNT) >> 4)           /*!< RX FIFO bit count  */
#define RSTAT_DPID(x)             ((uint8_t)(((x) & GRSTATRP_DPID) >> 15)) /*!< RX FIFO data PID  */
#define RSTAT_PCKST(x)            (((x) & GRSTATRP_RPCKST) >> 17)          /*!< RX FIFO packet status  */

#define DEV_ADDR(x)               (((x) << 4) & DCFG_DAR)                  /*!< device address  */

#define DCFG_DEVSPEED(regval)     (DCFG_DS & ((regval) << 0U))      /*!< device speed configuration */

#define USB_SPEED_EXP_HIGH        DCFG_DEVSPEED(0U)                 /*!< device external PHY high speed */
#define USB_SPEED_EXP_FULL        DCFG_DEVSPEED(1U)                 /*!< device external PHY full speed */
#define USB_SPEED_INP_FULL        DCFG_DEVSPEED(3U)                 /*!< device internal PHY full speed */

#define GAHBCS_TFEL(regval)       (GAHBCS_TXFTH & ((regval) << 7U)) /*!< device speed configuration */

#define TXFIFO_EMPTY_HALF         GAHBCS_TFEL(0U)                   /*!< Tx FIFO half empty */
#define TXFIFO_EMPTY              GAHBCS_TFEL(1U)                   /*!< Tx FIFO completely empty */

#define DCFG_PFRI(regval)         (DCFG_EOPFT & ((regval) << 11U))  /*!< end of periodic frame time configuration */

#define FRAME_INTERVAL_80         DCFG_PFRI(0U)                     /*!< 80% of the frame time */
#define FRAME_INTERVAL_85         DCFG_PFRI(1U)                     /*!< 85% of the frame time */
#define FRAME_INTERVAL_90         DCFG_PFRI(2U)                     /*!< 90% of the frame time */
#define FRAME_INTERVAL_95         DCFG_PFRI(3U)                     /*!< 95% of the frame time */

#define INT_BIT_IN(x)             ((uint32_t)1U << (x))             /*!< interrupt bit of IN endpoint  */              
#define INT_BIT_OUT(x)            (((uint32_t)1U << (x)) << 16)     /*!< interrupt bit of OUT endpoint */

#define USB_EP_XLEN(x)            (((uint32_t)(x)) & DEPLEN_TLEN)           /*!< endpoint transfer length */
#define USB_EP_XPCNT(x)           (((uint32_t)(x) << 19) & DEPLEN_PCNT)     /*!< endpoint transfer packet count */
#define USB_EP_STPCNT(x)          (((uint32_t)(x) << 29) & DOEPLEN_STPCNT)  /*!< endpoint transfer setup packet count */

#define DEP0_MPL(regval)          (DEP0CTL_MPL & ((regval) << 0U))  /*!< maximum packet length configuration */

#define EP0MPL_64                 DEP0_MPL(0U)                      /*!< maximum packet length 64 bytes */
#define EP0MPL_32                 DEP0_MPL(1U)                      /*!< maximum packet length 32 bytes */
#define EP0MPL_16                 DEP0_MPL(2U)                      /*!< maximum packet length 16 bytes */
#define EP0MPL_8                  DEP0_MPL(3U)                      /*!< maximum packet length 8 bytes */

#define DEP_TYPE(x)               (((uint32_t)(x) << 18U) & DEPCTL_EPTYPE)  /*!< device endpoint type */
#define DEP_TXFNUM(x)             (((uint32_t)(x) << 22U) & DIEPCTL_TXFNUM) /*!< device endpoint Tx FIFO number */

#define FIFO_NUM(x)               ((uint32_t)(x) << 6U)             /*!< host fifo number */

#define TX_FIFO_SIZE(x)           ((uint32_t)(x) << 16U)            /*!< Tx FIFO size */

#define CH_DIR(x)                 ((USB_HCHxCTL(x) & HCHCTL_EPDIR) >> 15)  /*!< channel direction */
#define CH_EPTYPE(x)              ((USB_HCHxCTL(x) & HCHCTL_EPTYPE) >> 18) /*!< channel endpoint number */

#define HFQ_CNUM_OFFSET           27U
#define HP_SPEED_OFFSET           17U

#define USB_CH_MPL(x)             (((uint32_t)(x)) & HCHCTL_MPL)            /*!< channel max packet length */
#define USB_CH_EPNUM(x)           (((uint32_t)(x) << 11U) & HCHCTL_EPNUM)   /*!< channel endpoint number */
#define USB_CH_EPDIR(x)           (((uint32_t)(x) << 15U) & HCHCTL_EPDIR)   /*!< channel endpoint direction */
#define USB_CH_LSDEV(x)           (((uint32_t)(x) << 17U) & HCHCTL_LSD)     /*!< channel low speed attribute */
#define USB_CH_EPTYPE(x)          (((uint32_t)(x) << 18U) & HCHCTL_EPTYPE)  /*!< channel endpoint type */
#define USB_CH_DAR(x)             (((uint32_t)(x) << 22U) & HCHCTL_DAR)     /*!< channel device address */

#define USB_CH_XLEN(x)            (((uint32_t)(x)) & HCHLEN_TLEN)           /*!< channel transfer length */
#define USB_CH_XPCNT(x)           (((uint32_t)(x) << 19) & HCHLEN_PCNT)     /*!< channel transfer packet count */
#define USB_CH_XDPID(x)           (((uint32_t)(x) << 29) & HCHLEN_DPID)     /*!< channel transfer data PID */

/* endpoints address */
/* first bit is direction(0 for Rx and 1 for Tx) */
#define EP0_OUT                   ((uint8_t)0x00U)                  /*!< endpoint out 0 */
#define EP0_IN                    ((uint8_t)0x80U)                  /*!< endpoint in 0 */
#define EP1_OUT                   ((uint8_t)0x01U)                  /*!< endpoint out 1 */
#define EP1_IN                    ((uint8_t)0x81U)                  /*!< endpoint in 1 */
#define EP2_OUT                   ((uint8_t)0x02U)                  /*!< endpoint out 2 */
#define EP2_IN                    ((uint8_t)0x82U)                  /*!< endpoint in 2 */
#define EP3_OUT                   ((uint8_t)0x03U)                  /*!< endpoint out 3 */
#define EP3_IN                    ((uint8_t)0x83U)                  /*!< endpoint in 3 */

/* enable global interrupt */
#define USB_GLOBAL_INT_ENABLE()       (USB_GAHBCS |= GAHBCS_GINTEN)

/* disable global interrupt */
#define USB_GLOBAL_INT_DISABLE()      (USB_GAHBCS &= ~GAHBCS_GINTEN)

